Tekla.Structures.Plugins.CustomPartBase.CustomPartInputType
Defines the type of the input. Not supported fully yet in core

Tekla.Structures.Plugins.CustomPartBase.CustomPartInputType.INPUT_MAX_10_POINTS
The input is any number points (max 10 points). The data is returned as an array list of points.